package goit;

public class Fibonacci {



    /**Часова складність:
                O(n), оскільки метод містить один цикл, який виконується n−1 разів.
     Просторова складність:
                O(1), оскільки для зберігання проміжних результатів
                використовуються лише кілька додаткових змінних.
     Найкраще підходить діаграма діяльності**/
    public int fibonacciIterative(int n) {
        if (n <= 1) return n;
        int a = 0, b = 1, result = 0;
        for (int i = 2; i <= n; i++) {
            result = a + b;
            a = b;
            b = result;
        }
        return result;
    }


    /**Часова та просторова складності:
     Часова складність:
                O(2^n), оскільки метод викликає себе двічі,
                що створює експоненціальну кількість викликів.
     Просторова складність:
                O(n), оскільки для кожного виклику методу
                зберігається новий контекст у стеку.
     Найкраще підходить діаграма послідовності**/
    public int fibonacciRecursive(int n) {
        if (n <= 1) return n;
        return fibonacciRecursive(n - 1) + fibonacciRecursive(n - 2);
    }

    /**Часова складність:
                    𝑂(𝑛), оскільки метод обчислює кожен елемент один раз.
      Просторова складність: O(n), оскільки для зберігання
                    результатів використовується масив dp розміром n+1.
     Найкраще пдходить діаграма станів**/
    public int fibonacciDP(int n) {
        if (n <= 1) return n;
        int[] dp = new int[n + 1];
        dp[0] = 0;
        dp[1] = 1;
        for (int i = 2; i <= n; i++) {
            dp[i] = dp[i - 1] + dp[i - 2];
        }
        return dp[n];
    }

}
